

%假设船的方程为这种形式
%z=Ax^2+B*|x|+Cy^
%通过测量重物的长度为0.094m,半径为0.02m
%A调大会变窄
%C调大会变短


A=9;
B=0.5;                                                                           
C=3;
D=0;
H=0.15;
p=0.5/0.3;                                                                  %木板的面密度
format long
% m1=0.9350;                                                                  %重物质量
% m2=0.1065;                                                                  %桅杆质量
% m3=the_m_of_deck(A,B,C,D,H);
% m=m1+m2+m3;
% the_need_V=m.*10^(-3);


% disp('********************开始绘制船体***********************')
draw(A,B,C,D,H)                                                             %z=Ax^2+B*|x|+Cy^2+D*|y| 分别以ABCDH为参数
% disp('********************船体绘制完毕***********************')
% disp(' ')
% 
% disp('********************开始计算甲板方程*******************')
% Deck_Equation(A,B,C,D,H)                                                    %输出甲板方程  H为船的高度
% disp('********************甲板方程计算完毕*******************')



disp('********************开始计算船身总质量******************')
disp('重物质量')
m1=0.9350                                                                  %重物质量
disp('桅杆质量')
m2=0.1065                                                                  %桅杆质量
disp('甲板质量')
m3=the_m_of_deck(A,B,C,D,H)                                                %甲板质量中间镂空  
disp('龙骨质量')
m4=the_m_of_keel(A,B,C,D,H)                                                %龙骨质量
disp('肋骨质量')
[the_center_of_rid,m5]=the_m_of_rib(A,B,C,D,H)                                                 %肋骨质量


disp('总质量')
m=m1+m2+m3+m4+m5
the_need_V=m.*10^(-3)
disp('********************计算完毕******************')

%the_center_of_rid=the_center_of_rid(A,B,C,D,H)            %肋骨质心

%计算船的长和宽
length_and_width(A,B,C,D,H)


% disp('********************计算吃水线*************************')
%waterline(A,B,C,D,the_need_V)                                               %计算吃水线，需人为调整范围以加快计算   0.089
% disp('********************计算完毕***************************')
% 


% 
% disp('********************计算质心******************')
z_center_of_m=the_center_of_m(m1,m2,m3,m4,m5,the_center_of_rid)            %0.069
% disp('******************计算完毕******************')

% disp('********************计算之后140度的吃水线******************')  %错误
%buoyant_center_140(A,B,C,D,H,the_need_V)


%new_buoyant_centre(A,B,C,D,H,the_need_V,m,z_center_of_m)            %正确

